name: "sklearn_pipeline"
backend: "python"

max_batch_size: 0

input [
  {
    name: "input__0"
    data_type: TYPE_FP32
    dims: [ 1, 4 ]
  }
]

output [
  {
    name: "output__0"
    data_type: TYPE_INT32
    dims: [ 1, 4 ]
  }
]

instance_group [
  {
    kind: KIND_CPU
  }
]
